[
  {
    "id": 1,
    "image": "https://www.pexels.com/photo/close-up-shot-of-a-pizza-6605214/",
    "title": "Margherita Pizza",
    "description": "One of the simplest and most traditional pizzas is the Margherita, which is topped with tomatoes or tomato sauce, mozzarella, and basil. Popular legend relates that it was named for Queen Margherita, wife of Umberto I, who was said to have liked its mild fresh flavour and to have also noted that its topping colours—green, white, and red—were those of the Italian flag.",
    "ingredients": [
      "For the base- 300g strong bread flour",
      "1 tsp instant yeast (from a sachet or a tub)",
      "1 tsp salt",
      "1 tbsp olive oil, plus extra for drizzling",
      "For the tomato- sauce",
      "100ml passata",
      "handful fresh basil or 1 tsp dried",
      "1 garlic clove, crushed",
      "For the topping- 125g ball mozzarella, sliced",
      "handful grated or shaved parmesan (or vegetarian alternative)",
      "handful of cherry tomatoes, halved",
      "To finish- handful of basil leaves (optional)"
    ],
    "instructions": [
      "Step 1: Make the base- Put the flour into a large bowl, then stir in the yeast and salt. Make a well, pour in 200ml warm water and the olive oil and bring together with a wooden spoon until you have a soft, fairly wet dough. Turn onto a lightly floured surface and knead for 5 mins until smooth. Cover with a tea towel and set aside. You can leave the dough to rise if you like, but it is not essential for a thin crust.",
      "Step 2: Make the sauce- Mix the passata, basil, and crushed garlic together, then season to taste. Leave to stand at room temperature while you get on with shaping the base.",
      "Step 3: Roll out the dough- if you have let the dough rise, give it a quick knead, then split into two balls. On a floured surface, roll out the dough into large rounds, about 25cm across, using a rolling pin. The dough needs to be very thin as it will rise in the oven. Lift the rounds onto two floured baking sheets.",
      "Step 4: Top and bake- heat the oven to 240C/220C fan/gas 8. Put another baking sheet or an upturned baking tray in the oven on the top shelf. Smooth sauce over bases with the back of a spoon. Scatter with cheese and tomatoes, drizzle with olive oil and season. Put one pizza, still on its baking sheet, on top of the preheated sheet or tray. Bake for 8-10 mins until crisp. Serve with a little more olive oil, and basil leaves if using. Repeat step for remaining pizza."
    ],
    "tags": "Italian"
  },

  {
    "id": 2,
    "image": "https://www.pexels.com/photo/mouthwatering-pork-adobo-with-eggs-beside-the-bowl-of-rice-6896058/",
    "title": "Pork Adobo",
    "description": "Pork Adobo is made with succulent pork belly braised in vinegar, soy sauce, garlic, and onions. A delicious balance of salty and savory, this hearty stew is the Philippines national dish for a good reason!",
    "ingredients": [
      "2 lbs pork belly",
      "2 tablespoons garlic",
      "5 dried bay leaves",
      "4 tablespoons vinegar",
      "1/2 cup soy sauce",
      "1 tablespoon peppercorn",
      "2 cups water",
      "Salt to taste"
    ],
    "instructions": [
      "Step 1: Combine the pork belly, soy sauce, and garlic then marinate for at least 1 hour.",
      "Step 2: Heat the pot and put-in the marinated pork belly then cook for a few minutes.",
      "Step 3: Pour the remaining marinade, including garlic.",
      "Step 4: Add water, whole peppercorns, and dried bay leaves then bring to a boil. Simmer for 40 minutes to 1 hour.",
      "Step 5: Put-in the vinegar and simmer for 12 to 15 minutes.",
      "Step 6: Add salt to taste.",
      "Step 7: Serve hot. Share and enjoy!"
    ],
    "tags": "Filipino"
  },

  {
    "id": 3,
    "image": "https://www.pexels.com/photo/savory-peking-duck-dish-on-an-earthenware-5848595/",
    "title": "Peking Duck",
    "description": "One of the most symbolic dishes of Chinese Cuisine, Peking Duck is a delicacy named after the city where it was invented several hundred years ago (Peking is an older variation of the word Beijing).",
    "ingredients": [
      "1 (4 pound) whole duck, dressed",
      "½ teaspoon ground cinnamon",
      "½ teaspoon ground ginger",
      "¼ teaspoon ground nutmeg",
      "¼ teaspoon ground white pepper",
      "⅛ teaspoon ground cloves",
      "3 tablespoons soy sauce, divided",
      "1 tablespoon honey",
      "5 green onions, divided",
      "½ cup plum jam",
      "¼ cup finely chopped chutney",
      "1 ½ teaspoons sugar",
      "1 ½ teaspoons distilled white vinegar",
      "1 orange, sliced in rounds",
      "1 tablespoon chopped fresh parsley, for garnish"
    ],
    "instructions": [
      "Step 1: Rinse the duck inside and out; pat dry. Cut off the tail and discard.",
      "Step 2: Mix together cinnamon, ginger, nutmeg, white pepper, and cloves in a small bowl. Sprinkle 1 teaspoon of the spice mixture into the cavity of the duck. Stir 1 tablespoon of soy sauce into the remaining spice mixture and rub it evenly over the entire outside of the duck. Cut 1 green onion in half and tuck it inside the cavity. Cover and refrigerate the duck for at least 2 hours or up to overnight.",
      "Step 3: Place the duck breast-side up on a rack set in a wok or pot. Steam for 1 hour, adding more water as it evaporates. Lift the duck with two large spoons to drain juices and green onion. Place the duck breast-side up in a roasting pan and prick the skin all over with a fork.",
      "Step 4: Preheat the oven to 375 degrees F (190 degrees C).",
      "Step 5: Roast the duck in the preheated oven for 30 minutes.",
      "Step 6: Mix together the remaining 2 tablespoons of soy sauce and honey in a small bowl. Brush the honey mixture onto the duck.",
      "Step 7: Increase the oven temperature to 500 degrees F (260 degrees C). Roast until the skin is richly browned, about 5 minutes. Do not allow the skin to char.",
      "Step 8: Mix together plum jam, chutney, sugar, and vinegar in a small serving bowl. Chop the remaining green onions and place them into a separate bowl.",
      "Step 9: Place the whole duck onto a serving platter and garnish with orange slices and fresh parsley. Serve with plum sauce and chopped green onions."
    ],
    "tags": "Chinese"
  },

  {
    "id": 4,
    "image": "https://www.pexels.com/photo/guacamole-and-chips-on-a-bowl-7601338/",
    "title": "Guacamole",
    "description": "Guacamole is undoubtedly one of Mexico's most popular dishes, but few people know that this traditional sauce dates back to the time of the Aztecs. Made from mashed-up avocados, onions, tomatoes, lemon juice, and chili peppers (and sometimes a clove or two of garlic), guacamole is often eaten with tortilla chips or used as a side dish.",
    "ingredients": [
      "1 large ripe tomato",
      "3 avocados, very ripe but not bruised",
      "juice of 1 large lime",
      "handful of coriander (leaves and stalks chopped), plus a few leaves roughly chopped to serve",
      "1 small red onion, finely chopped",
      "1 chili, red or green, deseeded and finely chopped",
      "tortilla chips, to serve"
    ],
    "instructions": [
      "Step 1: Use a large knife to pulverize 1 large ripe tomato to a pulp on a board, then tip it into a bowl.",
      "Step 2: Halve and stone the 3 avocados (saving a stone) and use a spoon to scoop out the flesh into the bowl with the tomato.",
      "Step 3: Add the juice of 1 large lime, a handful of roughly chopped coriander, 1 finely chopped small red onion, and 1 deseeded and finely chopped red or green chili to the bowl. Season with salt and pepper.",
      "Step 4: Use a whisk or fork to roughly mash everything together. If not serving straight away, place a stone in the guacamole (this helps to stop it from going brown), cover with cling film, and chill until needed."
    ],
    "tags": "Mexican"
  },
  {
    "id": 5,
    "image": "https://www.pexels.com/photo/pork-with-bell-peppers-and-sauce-7949919/",
    "title": "Sweet and Sour Pork",
    "description": "A Chinese stir-fry dish made with juicy pieces of pork tenderloin, bell peppers, onion, and pineapple. Battered pork gets fried until crispy then tossed in a sweet and tangy sauce.",
    "ingredients": [
      "1 pork fillet (about 500g), trimmed and cut into 3cm chunks",
      "sunflower or vegetable oil, for deep-frying",
      "cooked rice or noodles, to serve",
      "For the marinade",
      "1 tbsp light soy sauce",
      "2 tbsp shoaxing rice wine or dry sherry",
      "1 garlic clove, grated",
      "thumb-sized piece ginger, grated",
      "For the coating",
      "50g cornflour",
      "½ tsp salt",
      "1 tsp ground white pepper",
      "2 tsp celery salt",
      "2 tsp caster sugar",
      "For the sauce",
      "1 tbsp sunflower oil",
      "2 garlic cloves, finely chopped",
      "thumb-sized piece ginger, chopped",
      "1 green or red pepper, roughly chopped",
      "2 tbsp tomato ketchup",
      "4 tbsp rice vinegar",
      "1 tsp sesame oil",
      "2 tbsp light soy sauce",
      "1 tbsp soft brown sugar",
      "300g can pineapple chunks",
      "1 tbsp sesame seeds",
      "For the batter",
      "100g rice flour",
      "100g cornflour",
      "1 tsp baking powder"
    ],
    "instructions": [
      "Step 1: Mix the pork with the marinade ingredients and leave to sit for at least 15 mins, or chill for a few hours. In a separate bowl, mix all the coating ingredients. Drain any excess liquid off the pork and toss the pork in the seasoned coating. Can be done 1 hr ahead.",
      "Step 2: To make the sauce, heat the oil in a shallow saucepan and gently fry the garlic, ginger, and peppers until just starting to soften. Now drop in all the rest of the ingredients except the sesame seeds. Bring everything to the boil and cook for a few mins until thickened, then take off the heat. To make the batter, whisk the flours and baking powder together with 200ml water to a smooth paste.",
      "Step 3: Heat the oil in a deep-fat fryer, large saucepan, or a wok to 180C or until a drop of batter sizzles and browns in 20 secs. Dip the marinated pork in the batter mix (do it in two or three batches) and let any excess drip off. Fry the pork in batches for about 5-6 mins or until golden. Remove and drain on kitchen paper until all the batches are done. Make sure you bring the oil back to the correct temperature between each batch. Coat the crispy pork in the sauce, then sprinkle over the sesame seeds, coriander, and serve with rice or noodles."
    ],
    "tags": "Chinese"
  },

  {
    "id": 6,
    "image": "https://www.pexels.com/photo/cooked-meat-on-plate-2313686/",
    "title": "Sisig",
    "description": "Sisig is a Filipino dish made from pork jowl and ears (maskara), pork belly, and chicken liver which is usually seasoned with calamansi, onions, and chili peppers. It originates from the Pampanga region in Luzon.",
    "ingredients": [
      "1 lb. pig ears",
      "1 1/2 lb pork belly",
      "1 piece onion, minced",
      "3 tablespoons soy sauce",
      "1/4 teaspoon ground black pepper",
      "1 knob ginger, minced (optional)",
      "3 tablespoons chili flakes",
      "1/2 teaspoon garlic powder",
      "1 piece lemon or 3 to 5 pieces calamansi",
      "½ cup butter or margarine",
      "¼ lb chicken liver",
      "6 cups water",
      "3 tablespoons mayonnaise",
      "1/2 teaspoon salt",
      "1 piece egg (optional)"
    ],
    "instructions": [
      "Step 1: Pour the water in a pan and bring to a boil. Add salt and pepper.",
      "Step 2: Put in the pig's ears and pork belly, then simmer for 40 minutes to 1 hour (or until tender).",
      "Step 3: Remove the boiled ingredients from the pot, then drain excess water.",
      "Step 4: Grill the boiled pig's ears and pork belly until done.",
      "Step 5: Chop the pig's ears and pork belly into fine pieces.",
      "Step 6: In a wide pan, melt the butter or margarine. Add the onions. Cook until onions are soft.",
      "Step 7: Put in the ginger and cook for 2 minutes.",
      "Step 8: Add the chicken liver. Crush the chicken liver while cooking it in the pan.",
      "Step 9: Add the chopped pig's ears and pork belly. Cook for 10 to 12 minutes.",
      "Step 10: Put in the soy sauce, garlic powder, and chili. Mix well.",
      "Step 11: Add salt and pepper to taste.",
      "Step 12: Put in the mayonnaise and mix with the other ingredients.",
      "Step 13: Transfer to a serving plate. Top with chopped green onions and raw egg.",
      "Step 14: Serve hot. Share and enjoy (add the lemon or calamansi before eating)."
    ],
    "tags": "Filipino"
  },

  {
    "id": 7,
    "image": "https://www.pexels.com/photo/pasta-with-shrimp-on-white-ceramic-plate-4518839/",
    "title": "Carbonara",
    "description": "Carbonara is a Roman pasta dish made with eggs, hard cheese, cured pork, and black pepper. The dish took its modern form and name in the middle of the 20th century...",
    "ingredients": [
      "200g pancetta or guanciale",
      "400g spaghetti",
      "3 large eggs",
      "100g pecorino cheese, grated",
      "Black pepper, freshly ground"
    ],
    "instructions": [
      "Step 1: Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions until al dente.",
      "Step 2: Meanwhile, cut the pancetta or guanciale into small cubes or thin slices.",
      "Step 3: In a large skillet, cook the pancetta or guanciale over medium heat until crispy and browned. Remove from heat and set aside.",
      "Step 4: In a bowl, whisk together the eggs, grated pecorino cheese, and a generous amount of freshly ground black pepper.",
      "Step 5: Drain the cooked spaghetti, reserving some of the pasta water.",
      "Step 6: Immediately add the hot spaghetti to the skillet with the pancetta or guanciale. Toss to combine and coat the pasta with the rendered fat.",
      "Step 7: Pour the egg and cheese mixture over the hot pasta and quickly toss to coat the strands evenly. The heat from the pasta will cook the eggs and create a creamy sauce. If needed, add a splash of reserved pasta water to thin out the sauce.",
      "Step 8: Serve the carbonara immediately, garnished with additional grated pecorino cheese and freshly ground black pepper."
    ],
    "tags": "Italian"
  },

  {
    "id": 8,
    "image": "https://www.pexels.com/photo/creamy-prawns-and-salad-on-taco-shells-on-a-ceramic-tray-10296429/",
    "title": "Pork Tacos",
    "description": "Mexican pork chili with a smoky barbecued flavor, served in crispy tortilla shells with ripe avocado. These easy pork tacos make a speedy family meal, ready in under 30 minutes.",
    "ingredients": [
      "2 tsp vegetable oil",
      "½ red onion, chopped",
      "2 tsp smoked paprika",
      "2 tsp ground cumin",
      "500g pack lean pork mince",
      "300ml passata",
      "5 tbsp barbecue sauce",
      "400g can black beans, drained",
      "small bunch coriander, chopped",
      "8 taco shells",
      "1 ripe avocado, peeled and sliced",
      "½ iceberg lettuce, finely shredded",
      "soured cream, to serve (optional)"
    ],
    "instructions": [
      "Step 1: Heat the oil in a large frying pan, add the chopped red onion, and cook for 5 minutes until softened. Sprinkle over the smoked paprika and ground cumin, and cook for 1 more minute. Add the lean pork mince, breaking it up with the back of a wooden spoon, and stir until cooked through.",
      "Step 2: Stir the passata and barbecue sauce into the pan, along with 4 tablespoons of water. Increase the heat and allow the sauce to bubble and reduce until it clings to the meat. Add the drained black beans, season with salt and pepper, and cook for a further 2 minutes. Then, stir in the chopped coriander. Heat the taco shells following the package instructions.",
      "Step 3: Use the pork and bean mixture to fill the taco shells. Top with slices of avocado, shredded iceberg lettuce, and a dollop of soured cream, if desired."
    ],

    "tags": "Mexican"
  }
]

